### Pandas

- Pandas is an open soucre library mainly for workin with relational and labelled data.
- It is built on top of Numpy library
- Pandas generally provide two data strctures for manipulating data.
<br>
 
     - **Series**
     - **DataFrame**

**Pandas Series** is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. Pandas Series is nothing but a column in an excel sheet.

#### Creating Series

In [2]:
import pandas as pd  
import numpy as np 
  
# series from array  
data = np.array(['g', 'e', 'e', 'k', 's'])  
    
ser_arr = pd.Series(data)  
print(ser_arr)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [5]:
# series from list  
list = ['g', 'e', 'e', 'k', 's']
    
ser_list = pd.Series(list)  
print(ser_list)

0    g
1    e
2    e
3    k
4    s
dtype: object

#### Accessing element of Series

In [12]:
# using index number

# creating simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data)
  
# retrieve the first five element
print(ser[:5])

0    g
1    e
2    e
3    k
4    s
dtype: object

In [13]:
# using index label

# creating simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,22])
  
# accessing a element using index element
print(ser[16])

o

In [14]:
bank = pd.read_csv("D:/Git_Projects/Data-Science-with-Python/Datasets/bank.csv", header=0)

In [15]:
print(bank.shape)

(45211, 20)

In [19]:
bank.head()

,age,job,salary,marital,education,marital-education,targeted,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,100000.0,married,tertiary,married-tertiary,yes,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,60000.0,single,secondary,single-secondary,yes,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,120000.0,married,secondary,married-secondary,yes,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,20000.0,married,unknown,married-unknown,no,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,0.0,single,unknown,single-unknown,no,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [18]:
age = bank["age"]
age.head()

0    58
1    44
2    33
3    47
4    33
Name: age, dtype: int64

#### Indexing a Series using .loc[ ]

This function selects data by refering the explicit index . The df.loc indexer selects data in a different way than just the indexing operator. It can select subsets of data.

In [20]:
age.loc[10:15]  # this will fetch data from index label 10 to 15

10    41
11    29
12    53
13    58
14    57
15    51
Name: age, dtype: int64

#### Indexing a Series using .iloc[ ]

This function allows us to retrieve data by position. In order to do that, weâ€™ll need to specify the positions of the data that we want. The df.iloc indexer is very similar to df.loc but only uses integer locations to make its selections.

In [21]:
age.iloc[10:15]   #it will fetch data from index 10 to 14

10    41
11    29
12    53
13    58
14    57
Name: age, dtype: int64

**Pandas DataFrame** is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

In the real world, a Pandas DataFrame will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, and Excel file. Pandas DataFrame can be created from the lists, dictionary, and from a list of dictionary etc.

#### Creating DatFrames

In [23]:
# dataframe from list

# list of strings
lst = ['Pandas', 'is', 'built', 'on', 'top', 'of', 'Numpy', 'library']
 
# Calling DataFrame constructor on list
df_list = pd.DataFrame(lst)
df_list

         0
0   Pandas
1       is
2    built
3       on
4      top
5       of
6    Numpy
7  library

In [24]:
# dataframe from dictionary

# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 

df_dict = pd.DataFrame(data)
df_dict

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

#### Dealing with Rows and Columns

In [3]:
bank = pd.read_csv("D:/Git_Projects/Data-Science-with-Python/Datasets/bank.csv", header=0)

In [4]:
# print shape of bank dataframe

bank.shape

# 45211 - rows
# 20 - columns

(45211, 20)

In [7]:
# print dimension of dataframe

bank.ndim

2

In [10]:
# print column labels of dataframe

bank.columns

Index(['age', 'job', 'salary', 'marital', 'education', 'marital-education',
       'targeted', 'default', 'balance', 'housing', 'loan', 'contact', 'day',
       'month', 'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y'],
      dtype='object')

In [11]:
# print index label of dataframe

bank.index

RangeIndex(start=0, stop=45211, step=1)

In [26]:
bank.head()

,age,job,salary,marital,education,marital-education,targeted,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,100000.0,married,tertiary,married-tertiary,yes,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,60000.0,single,secondary,single-secondary,yes,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,120000.0,married,secondary,married-secondary,yes,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,20000.0,married,unknown,married-unknown,no,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,0.0,single,unknown,single-unknown,no,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [28]:
# select one column

bank["job"].head()

0      management
1      technician
2    entrepreneur
3     blue-collar
4         unknown
Name: job, dtype: object

In [35]:
# select multiple columns

bank[["age","job","salary"]].head()

   age           job    salary
0   58    management  100000.0
1   44    technician   60000.0
2   33  entrepreneur  120000.0
3   47   blue-collar   20000.0
4   33       unknown       0.0

In [38]:
# selecting single rows using loc

# print row data for index label 2
bank.loc[2]

age                                 33
job                       entrepreneur
salary                          120000
marital                        married
education                    secondary
marital-education    married-secondary
targeted                           yes
default                             no
balance                              2
housing                            yes
loan                               yes
contact                        unknown
day                                  5
month                              may
duration                            76
campaign                             1
pdays                               -1
previous                             0
poutcome                       unknown
y                                   no
Name: 2, dtype: object

In [39]:
# selecting multiple rows using loc

# print row data for index label 0,1 and 2
bank.loc[0:2]

,age,job,salary,marital,education,marital-education,targeted,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,100000.0,married,tertiary,married-tertiary,yes,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,60000.0,single,secondary,single-secondary,yes,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,120000.0,married,secondary,married-secondary,yes,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no

In [41]:
# selecting single row using iloc

# print row data for index label 2
bank.iloc[2]

age                                 33
job                       entrepreneur
salary                          120000
marital                        married
education                    secondary
marital-education    married-secondary
targeted                           yes
default                             no
balance                              2
housing                            yes
loan                               yes
contact                        unknown
day                                  5
month                              may
duration                            76
campaign                             1
pdays                               -1
previous                             0
poutcome                       unknown
y                                   no
Name: 2, dtype: object

In [42]:
# selecting multiple row using iloc

# print row data for index label 0 and 1 (2 is excluded)
bank.iloc[0:2]

,age,job,salary,marital,education,marital-education,targeted,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,100000.0,married,tertiary,married-tertiary,yes,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,60000.0,single,secondary,single-secondary,yes,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no